app/views/artists/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---

  <% @artist.songs.each do |song| %>