app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      if @artist = Artist.find_by_id(params[:artist_id])
        if @song = @artist.songs.find_by_id(params[:id])